cases/flowCaseBig/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
simulationType  RAS;
RAS
{
    RASModel        kEpsilon;
    turbulence      on;
    printCoeffs     on;
    // Neutral-ABL tuning (Hargreaves & Wright, JWEIA 95 (2007) 355-369)
    kEpsilonCoeffs
    {
        Cmu        0.09;
        C1         1.44;
        C2         1.92;
        sigmaEps   1.11;
    }
}
// ************************************************************************* //
