cases/flowCaseBig/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "include/ABLConditions"
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform $Uvector;
boundaryField
{
    inletOutlet
    {
        type            atmBoundaryLayerInletVelocity;
        #include         "include/ABLConditions"
        z0               $z0;
        value            uniform $Uvector;
    }
    top                  { type symmetry; }
    bottom      { type slip; }
    Buildings { type noSlip; }
    Terrain { type noSlip; }
}
// ************************************************************************* //
